## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 0 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.aws_lambda_traffic_shifting_action_demo will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_traffic_shifting_action_demo" {
        id                             = "aws_lambda_traffic_shifting_action_demo"
      ~ last_modified                  = "2022-09-22T18:38:47.039+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:017790921725:function:aws_lambda_traffic_shifting_action_demo:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:017790921725:function:aws_lambda_traffic_shifting_action_demo:2/invocations" -> (known after apply)
      ~ source_code_hash               = "ebD1IJXl6ckiNlLPG0ZhyU7RKFekjFS+AngI8Z047VY=" -> "rlZzoPoNPN8sz2xtN01HLfz3apkGZmMhAQj4+Ww4fBI="
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.trigger_aws_lambda_traffic_shifting_action_demo"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.aws_lambda_traffic_shifting_action_demo"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_lambda_traffic_shifting_action_demo"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.aws_lambda_traffic_shifting_action_demo"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.aws_lambda_traffic_shifting_action_demo"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

23 tests, 17 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
